7h3qu1rkyb1t/stm32f7-drivers/drivers/inc/stm32f767xx_SAI.h
#define  _SAI2_ACR1_MCKDIV                                   (0xf << 20)    // Master clock divider
#define  _SAI2_ACR1_NODIV                                    (0x1 << 19)    // No divider
#define  _SAI2_ACR1_DMAEN                                    (0x1 << 17)    // DMA enable
#define  _SAI2_ACR1_SAIAEN                                   (0x1 << 16)    // Audio block A enable
#define  _SAI2_ACR1_OutDri                                   (0x1 << 13)    // Output drive
#define  _SAI2_ACR1_MONO                                     (0x1 << 12)    // Mono mode
#define  _SAI2_ACR1_SYNCEN                                   (0x3 << 10)    // Synchronization enable
#define  _SAI2_ACR1_CKSTR                                    (0x1 << 9)    // Clock strobing edge
#define  _SAI2_ACR1_LSBFIRST                                 (0x1 << 8)    // Least significant bit first
#define  _SAI2_ACR1_DS                                       (0x7 << 5)    // Data size
#define  _SAI2_ACR1_PRTCFG                                   (0x3 << 2)    // Protocol configuration
#define  _SAI2_ACR1_MODE                                     (0x3 << 0)    // Audio block mode
#define  _SAI2_ACR2_COMP                                     (0x3 << 14)    // Companding mode
#define  _SAI2_ACR2_CPL                                      (0x1 << 13)    // Complement bit
#define  _SAI2_ACR2_MUTECN                                   (0x3f << 7)    // Mute counter
#define  _SAI2_ACR2_MUTEVAL                                  (0x1 << 6)    // Mute value
#define  _SAI2_ACR2_MUTE                                     (0x1 << 5)    // Mute
#define  _SAI2_ACR2_TRIS                                     (0x1 << 4)    // Tristate management on data line
#define  _SAI2_ACR2_FFLUS                                    (0x1 << 3)    // FIFO flush
#define  _SAI2_ACR2_FTH                                      (0x7 << 0)    // FIFO threshold
#define  _SAI2_AFRCR_FSOFF                                   (0x1 << 18)    // Frame synchronization offset
#define  _SAI2_AFRCR_FSPOL                                   (0x1 << 17)    // Frame synchronization polarity
#define  _SAI2_AFRCR_FSDEF                                   (0x1 << 16)    // Frame synchronization definition
#define  _SAI2_AFRCR_FSALL                                   (0x7f << 8)    // Frame synchronization active level length
#define  _SAI2_AFRCR_FRL                                     (0xff << 0)    // Frame length
#define  _SAI2_ASLOTR_SLOTEN                                 (0xffff << 16)    // Slot enable
#define  _SAI2_ASLOTR_NBSLOT                                 (0xf << 8)    // Number of slots in an audio frame
#define  _SAI2_ASLOTR_SLOTSZ                                 (0x3 << 6)    // Slot size
#define  _SAI2_ASLOTR_FBOFF                                  (0x1f << 0)    // First bit offset
#define  _SAI2_AIM_LFSDET                                    (0x1 << 6)    // Late frame synchronization detection interrupt enable
#define  _SAI2_AIM_AFSDETIE                                  (0x1 << 5)    // Anticipated frame synchronization detection interrupt enable
#define  _SAI2_AIM_CNRDYIE                                   (0x1 << 4)    // Codec not ready interrupt enable
#define  _SAI2_AIM_FREQIE                                    (0x1 << 3)    // FIFO request interrupt enable
#define  _SAI2_AIM_WCKCFG                                    (0x1 << 2)    // Wrong clock configuration interrupt enable
#define  _SAI2_AIM_MUTEDET                                   (0x1 << 1)    // Mute detection interrupt enable
#define  _SAI2_AIM_OVRUDRIE                                  (0x1 << 0)    // Overrun/underrun interrupt enable
#define  _SAI2_ASR_FLVL                                      (0x7 << 16)    // FIFO level threshold
#define  _SAI2_ASR_LFSDET                                    (0x1 << 6)    // Late frame synchronization detection
#define  _SAI2_ASR_AFSDET                                    (0x1 << 5)    // Anticipated frame synchronization detection
#define  _SAI2_ASR_CNRDY                                     (0x1 << 4)    // Codec not ready
#define  _SAI2_ASR_FREQ                                      (0x1 << 3)    // FIFO request
#define  _SAI2_ASR_WCKCFG                                    (0x1 << 2)    // Wrong clock configuration flag. This bit is read only.
#define  _SAI2_ASR_MUTEDET                                   (0x1 << 1)    // Mute detection
#define  _SAI2_ASR_OVRUDR                                    (0x1 << 0)    // Overrun / underrun
#define  _SAI2_ACLRFR_LFSDET                                 (0x1 << 6)    // Clear late frame synchronization detection flag
#define  _SAI2_ACLRFR_CAFSDET                                (0x1 << 5)    // Clear anticipated frame synchronization detection flag.
#define  _SAI2_ACLRFR_CNRDY                                  (0x1 << 4)    // Clear codec not ready flag
#define  _SAI2_ACLRFR_WCKCFG                                 (0x1 << 2)    // Clear wrong clock configuration flag
#define  _SAI2_ACLRFR_MUTEDET                                (0x1 << 1)    // Mute detection flag
#define  _SAI2_ACLRFR_OVRUDR                                 (0x1 << 0)    // Clear overrun / underrun
#define  _SAI2_ADR_DATA                                      (0xffffffff << 0)    // Data
#define  _SAI2_GCR_SYNCIN                                    (0x3 << 0)    // Synchronization inputs
#define  _SAI2_GCR_SYNCOUT                                   (0x3 << 4)    // Synchronization outputs
